Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: (/ -17 6) @result{} -2 @r{(could in theory be @minus{}3 on some machines)}
fr_fr: (/ -17 6) @result{} -2 @r{(pourrait être @minus{}3 sur certaines machines)}

source: (The term ``hash notation'' refers to the initial @samp{#} character---@pxref{Printed Representation}---and has nothing to do with the term ``hash table.'')
fr_fr: (Le terme ``notation de hachage'' correspond au caractère @samp{#} --- @pxref{Printed Representation} --- et n'a rien à voir avec le terme ``table de hachage''.)

source: (We have inserted spaces between groups of 4 bits, and two spaces between groups of 8 bits, to make the binary integer easier to read.)
fr_fr: (Nous avons inséré un espace entre les groupes de 4 bits, et deux espaces entre les groupes de 8 bits, pour faciliter la lecture du nombre entier binaire.)

source: (aref "abcdefg" 1) @result{} 98 ; @r{@samp{b} is @acronym{ASCII} code 98.}
fr_fr: (aref "abcdefg" 1) @result{} 98 ; @r{@samp{b} correspond à 98 en code @acronym{ASCII}.}

source: (arrayp [a]) @result{} t (arrayp "asdf") @result{} t (arrayp (syntax-table)) ;; @r{A char-table.} @result{} t
fr_fr: (arrayp [a]) @result{} t (arrayp "asdf") @result{} t (arrayp (syntax-table)) ;; @r{Une table de caractères.} @result{} t

source: (ash -6 -1) @result{} -3 ;; @r{Decimal @minus{}6 becomes decimal @minus{}3.} 1 1111 1111 1111 1111 1111 1111 1010 @result{} 1 1111 1111 1111 1111 1111 1111 1101
fr_fr: (ash -6 -1) @result{} -3 ;; @r{La décimale @minus{}6 devient la décimale @minus{}3.} 1 1111 1111 1111 1111 1111 1111 1010 @result{} 1 1111 1111 1111 1111 1111 1111 1101

source: (capitalize "THE 77TH-HATTED CAT") @result{} "The 77th-Hatted Cat"
fr_fr: (capitalize "LE 77EME CHAT BOTTE") @result{} "Le 77eme Chat Botte"

source: (capitalize "The cat in the hat") @result{} "The Cat In The Hat"
fr_fr: (capitalize "Le chat dans le chapeau") @result{} "Le Chat Dans Le Chapeau"

source: (concat "abc" "-def") @result{} "abc-def" (concat "abc" (list 120 121) [122]) @result{} "abcxyz" ;; @r{@code{nil} is an empty sequence.} (concat "abc" nil "-def") @result{} "abc-def" (concat "The " "quick brown " "fox.") @result{} "The quick brown fox." (concat) @result{} ""
fr_fr: (concat "abc" "-def") @result{} "abc-def" (concat "abc" (list 120 121) [122]) @result{} "abcxyz" ;; @r{@code{nil} est une suite vide.} (concat "abc" nil "-def") @result{} "abc-def" (concat "Le " "juge blond " "qui fume.") @result{} "Le juge blond qui fume." (concat) @result{} ""

source: (downcase "The cat in the hat") @result{} "the cat in the hat"
fr_fr: (downcase "Le chat dans le chapeau") @result{} "le chapeau dans le chapeau"

source: (exclusive) whose tangent is @var{y}. If the optional second argument @var{x} is given, the value of @code{(atan y x)} is the angle in radians between the vector @code{[@var{x}, @var{y}]} and the @code{X} axis.
fr_fr: (exclusif) dont la tangente est @var{y}. Si le deuxième argument facultatif @var{x} est donné, la valeur de @code{(atan y x)} est pêcher en radians entre le vecteur @code{[@var{x}, @var{y}]} et l'axis @code{X}.

source: (format "%-6d is padded on the right" 123) @result{} "123 is padded on the right"
fr_fr: (format "%-6d est bourré à droite" 123) @result{} "123 est bourré à droite"

source: (format "%06d is padded on the left with zeros" 123) @result{} "000123 is padded on the left with zeros"
fr_fr: (format "%06d est bourré à gauche avec des zéros" 123) @result{} "000123 est bourré à gauche avec des zéros"

source: (format "The buffer object prints as %s." (current-buffer)) @result{} "The buffer object prints as strings.texi."
fr_fr: (format "L'objet buffer imprime en %s." (current-buffer)) @result{} "L'objet mémoire tampon imprime en strings.texi."

source: (format "The name of this buffer is %s." (buffer-name)) @result{} "The name of this buffer is strings.texi."
fr_fr: (format "Le nom de ce buffer est %s." (buffer-name)) @result{} "Le nom de cette mémoire tampon est strings.texi."

source: (format "The octal value of %d is %o, and the hex value is %x." 18 18 18) @result{} "The octal value of 18 is 22, and the hex value is 12."
fr_fr: (format "La valeur octale de %d est %o, et la valeur hexadécimale est %x." 18 18 18) @result{} "La valeur octale de 18 est 22, et la valeur hexadécimale est 12."

source: (format "The value of fill-column is %d." fill-column) @result{} "The value of fill-column is 72."
fr_fr: (format "La valeur de fill-column est %d." fill-column) @result{} "La valeur de fill-column est 72."

source: (format "The word `%-7s' actually has %d letters in it." "foo" (length "foo")) @result{} "The word `foo ' actually has 3 letters in it."
fr_fr: (format "Le mot `%-7s' a effectivement %d lettres en lui." "foo" (length "foo")) @result{} "Le mot `foo ' a effectivement 3 lettres en lui."

source: (format "The word `%7s' actually has %d letters in it." "foo" (length "foo")) @result{} "The word ` foo' actually has 3 letters in it."
fr_fr: (format "Le mot `%7s' a effectivement %d lettres en lui." "foo" (length "foo")) @result{} "Le mot ` foo' a effectivement 3 lettres en lui."

source: (format "The word `%7s' actually has %d letters in it." "specification" (length "specification")) @result{} "The word `specification' actually has 13 letters in it."
fr_fr: (format "Le mot `%7s' a effectivement %d lettres en lui." "spécification" (length "spécification")) @result{} "Le mot `spécification' a effectivement 13 lettres en lui."

source: (inclusive) whose cosine is @var{arg}; if, however, @var{arg} is out of range (outside [@minus{}1, 1]), it signals a @code{domain-error} error.
fr_fr: (inclus) dont le cosinus est @var{arg} ; si, cependant, @var{arg} est hors de portée (en dehors de [@minus{} 1, 1]), il signale une erreur @code{domaine-error}.

source: (inclusive) whose sine is @var{arg}; if, however, @var{arg} is out of range (outside [@minus{}1, 1]), it signals a @code{domain-error} error.
fr_fr: (inclus) dont le sinus est @var{arg} ; si, cependant, @var{arg} est hors de portée (en dehors de [@minus{} 1, 1]), il signale une erreur @code{domaine-error}.

source: (lognot 5) @result{} -6 ;; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} ;; @r{becomes} ;; -6 = @r{1 1111 1111 1111 1111 1111 1111 1010}
fr_fr: (lognot 5) @result{} -6 ;; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} ;; @r{devient} ;; -6 = @r{1 1111 1111 1111 1111 1111 1111 1010}

source: (lsh -6 -1) @result{} 268435453 ;; @r{Decimal @minus{}6 becomes decimal 268,435,453.} 1 1111 1111 1111 1111 1111 1111 1010 @result{} 0 1111 1111 1111 1111 1111 1111 1101
fr_fr: (lsh -6 -1) @result{} 268435453 ;; @r{La décimale @minus{}6 devient la décimale 268 435 453.} 1 1111 1111 1111 1111 1111 1111 1010 @result{} 0 1111 1111 1111 1111 1111 1111 1101

source: (lsh 3 2) @result{} 12 ;; @r{Decimal 3 becomes decimal 12.} 00000011 @result{} 00001100
fr_fr: (lsh 3 2) @result{} 12 ;; @r{La décimale 3 devient décimale 12.} 00000011 @result{} 00001100

source: (lsh 5 -1) @result{} 2 ;; @r{Decimal 5 becomes decimal 2.} 00000101 @result{} 00000010
fr_fr: (lsh 5 -1) @result{} 2 ;; @r{La décimale 5 devient décimale 2.} 00000101 @result{} 00000010

source: (lsh 6 -1) @result{} 3 ;; @r{Decimal 6 becomes decimal 3.} 00000110 @result{} 00000011
fr_fr: (lsh 6 -1) @result{} 3 ;; @r{La décimale 6 devient décimale 3.} 00000110 @result{} 00000011

source: (lsh 7 1) @result{} 14 ;; @r{Decimal 7 becomes decimal 14.} 00000111 @result{} 00001110
fr_fr: (lsh 7 1) @result{} 14 ;; @r{La décimale 7 devient la décimale 14.} 00000111 @result{} 00001110

source: (split-string " two words " split-string-default-separators) @result{} ("" "two" "words" "")
fr_fr: (split-string " deux mots " split-string-default-separators) @result{} ("" "deux" "mots" "")

source: (split-string " two words ") @result{} ("two" "words")
fr_fr: (split-string " deux mots ") @result{} ("deux" "mots")

source: (string-to-number "256") @result{} 256 (string-to-number "25 is a perfect square.") @result{} 25 (string-to-number "X256") @result{} 0 (string-to-number "-4.5") @result{} -4.5 (string-to-number "1e5") @result{} 100000.0
fr_fr: (string-to-number "256") @result{} 256 (string-to-number "25 est un carrée parfait.") @result{} 25 (string-to-number "X256") @result{} 0 (string-to-number "-4.5") @result{} -4.5 (string-to-number "1e5") @result{} 100000.0

source: (symbol-name 'foo) @result{} "foo"
fr_fr: (symbol-name 'toto) @result{} "toto"

source: (upcase "The cat in the hat") @result{} "THE CAT IN THE HAT"
fr_fr: (upcase "Le chat dans le chapeau") @result{} "LE CHAT DANS LE CHAPEAU"

source: (upcase-initials "The CAT in the hAt") @result{} "The CAT In The HAt"
fr_fr: (upcase-initials "Le CHAT dans le cHapeau") @result{} "Le CHAT Dans Le CHapeau"

source: * A Sample Function Description:: A description of an imaginary function, @code{foo}. * A Sample Variable Description:: A description of an imaginary variable, @code{electric-future-map}.
fr_fr: * Un exemple d'une description de fonction:: Une description d'une imaginaire fonction, @code{foo}. * Un exemple d'une description de variable:: Une description d'une imaginaire variable, @code{electric-future-map}.

source: * Abbrev Mode:: Setting up Emacs for abbreviation. * Abbrev Tables:: Creating and working with abbrev tables. * Defining Abbrevs:: Specifying abbreviations and their expansions. * Abbrev Files:: Saving abbrevs in files. * Abbrev Expansion:: Controlling expansion; expansion subroutines. * Standard Abbrev Tables:: Abbrev tables used by various major modes.
fr_fr: * Mode abbrev:: Configuration d'Emacs pour l'abréviation. * Tables d'abréviations:: Créer et travailler avec des tables d'abréviations. * Définir des abréviations:: Spécifier des abréviations et leurs expansions. * Fichiers d'abréviations:: Sauver des abréviations dans les fichiers. * Expansions d'abréviations:: Contrôler l'expansion ; sous-programmes d'expansions. * Tables standard d'abréviations:: Tables d'abréviations employées par divers modes majeurs.

source: * Caveats:: Flaws and a request for help. * Lisp History:: Emacs Lisp is descended from Maclisp. * Conventions:: How the manual is formatted. * Version Info:: Which Emacs version is running? * Acknowledgements:: The authors, editors, and sponsors of this manual.
fr_fr: * Avertissements:: Erreurs et demande d'aide. * L'histoire de Lisp:: Emacs Lisp descend de Maclisp. * Conventions:: Comment le manuel est composé. * Information de version:: Quelle version d'Emacs fonctionne ? * Remerciements:: Les auteurs, les rédacteurs, et les commanditaires de ce manuel.

source: * Integer Basics:: Representation and range of integers. * Float Basics:: Representation and range of floating point. * Predicates on Numbers:: Testing for numbers. * Comparison of Numbers:: Equality and inequality predicates. * Numeric Conversions:: Converting float to integer and vice versa. * Arithmetic Operations:: How to add, subtract, multiply and divide. * Rounding Operations:: Explicitly rounding floating point numbers. * Bitwise Operations:: Logical and, or, not, shifting. * Math Functions:: Trig, exponential and logarithmic functions. * Random Numbers:: Obtaining random integers, predictable or not.
fr_fr: * Entiers basiques:: Représentation et champ des nombres entiers. * Nombres à virgule flottante basiques:: Représentation et champ des nombres à virgule flottante. * Attributs des nombres:: Tester les nombres. * Comparaison des nombres:: Attributs d'égalité et d'inégalité. * Conversions numériques:: Convertir des nombres à virgule flottante en nombres entiers et vice-versa. * Opérations arithmétiques:: Comment additionner, soustraire, multiplier et diviser. * Opérations d'arrondissage:: Arrondir explicitement les nombres à virgule flottante. * Opérations de bits:: and, or, not logique et décalage. * Fonctions mathématiques:: Fonctions trigonométrique, exponentielle et logarithmique. * Nombres aléatoires:: Obtention des nombres entiers aléatoires, prévisibles ou pas.

source: * Some Terms:: Explanation of terms we use in this manual. * nil and t:: How the symbols @code{nil} and @code{t} are used. * Evaluation Notation:: The format we use for examples of evaluation. * Printing Notation:: The format we use for examples that print output. * Error Messages:: The format we use for examples of errors. * Buffer Text Notation:: The format we use for buffer contents in examples. * Format of Descriptions:: Notation for describing functions, variables, etc.
fr_fr: * Quelques termes:: Explication des termes que nous employons en ce manuel. * nil et t:: Comment les symboles @code{nil} et @code{t} sont employés. * Notation d'évaluation:: Le format que nous employons pour des exemples de l'évaluation. * Notation d'affichage:: Le format que nous employons quand les exemples affichent du texte. * Messages d'erreur:: Le format que nous employons pour des exemples d'erreurs. * Notation des textes de tampon:: Le format que nous employons pour le contenu de tampons dans les exemples. * Format des descriptions:: Notation pour décrire des fonctions, des variables, etc.

source: 1 ; @r{The integer 1.} 1. ; @r{The integer 1.} +1 ; @r{Also the integer 1.} -1 ; @r{The integer @minus{}1.} 536870913 ; @r{Also the integer 1, due to overflow.} 0 ; @r{The integer 0.} -0 ; @r{The integer 0.}
fr_fr: 1 ; @r{L'entier 1.} 1. ; @r{L'entier 1.} +1 ; @r{Encore l'entier 1.} -1 ; @r{L'entier @minus{}1.} 536870913 ; @r{Encore l'entier 1, dû au débordement.} 0 ; @r{L'entier 0.} -0 ; @r{L'entier 0.}

source: ;; @r{Decimal 268,435,455} 0 1111 1111 1111 1111 1111 1111 1111
fr_fr: ;; @r{La décimale 268 435 455} 0 1111 1111 1111 1111 1111 1111 1111

source: ;; @r{Decimal @minus{}2} 1 1111 1111 1111 1111 1111 1111 1110
fr_fr: ;; @r{La décimale @minus{}2} 1 1111 1111 1111 1111 1111 1111 1110

source: ;; @r{Modifying the inside of a shared element.} (setcar (aref x 1) 69) x @result{} [quux (69 2)] y @result{} [foo (69 2)]
fr_fr: ;; @r{Modification du contenu d'un élément partagé.} (setcar (aref x 1) 69) x @result{} [quux (69 2)] y @result{} [foo (69 2)]

source: ;; @r{Replacing an element of one sequence.} (aset x 0 'quux) x @result{} [quux (1 2)] y @result{} [foo (1 2)]
fr_fr: ;; @r{Remplacement d'un élément d'une séquence.} (aset x 0 'quux) x @result{} [quux (1 2)] y @result{} [foo (1 2)]

source: ;; @r{We use @code{string} to show clearly which character @code{elt} returns.} (string (elt "1234" 2)) @result{} "3"
fr_fr: ;; On utilise les chaînes de caractères pour montrer quel caractère @code{elt} retourne. (string (elt "1234" 2)) @result{} "3"

source: @b{Common Lisp note:} Comparing numbers in Common Lisp always requires @code{=} because Common Lisp implements multi-word integers, and two distinct integer objects can have the same numeric value. Emacs Lisp can have just one integer object for any given value because it has a limited range of integer values.
fr_fr: @b{Common Lisp note:} Comparer des nombres en Common Lisp exige toujours @code{=} parce que le Common Lisp met en application des nombres entiers pluritermes, et deux objets distincts de nombre entier peuvent avoir la même valeur numérique. Emacs Lisp peut avoir juste un objet de nombre entier pour n'importe quelle valeur donnée parce qu'il a un champ limité des valeurs de nombre entier.

source: @b{Common Lisp note:} In Common Lisp, @code{clrhash} returns the empty @var{table}. In Emacs Lisp, it returns @code{nil}.
fr_fr: @b{Common Lisp note :} En Common Lisp, @code{clrhash} retourne la table vide @var{table}. En Lisp Emacs, elle retourne @code{nil}.

source: @b{Common Lisp note:} In Common Lisp, @code{remhash} returns non-@code{nil} if it actually removed an association and @code{nil} otherwise. In Emacs Lisp, @code{remhash} always returns @code{nil}.
fr_fr: @b{Common Lisp note :} En Common Lisp, @code{remhash} retourne non-@code{nil} s'il se trouve qu'elle a retiré une association et sinon @code{nil}. Dans Lisp Emacs, @code{remhash} retourne toujours @code{nil}.

source: @code{"Symbol's value as variable is void"}@* @xref{Accessing Variables}.
fr_fr: @code{"La valeur du symbole comme variable est vide"}@* @xref{Accès aux variables}.

source: @code{(zerop x)} is equivalent to @code{(= x 0)}.
fr_fr: @code{(zerop x)} est équivalent à @code{(= x 0)}.

source: @code{EMACSLOADPATH} environment variable
fr_fr: variable d'environnement @code{EMACSLOADPATH}

source: @code{append} can convert a string into a list. @xref{Building Lists}.
fr_fr: @code{append} peut convertir une chaîne en une liste. @xref{Building Lists}.

source: @code{ash} (@dfn{arithmetic shift}) shifts the bits in @var{integer1} to the left @var{count} places, or to the right if @var{count} is negative.
fr_fr: @code{ash} (@dfn{arithmetic shift}) décale les bits dans @var{integer1} de @var{count} places vers la gauche, ou vers la droite si @var{count} est négatif.

source: @code{ash} gives the same results as @code{lsh} except when @var{integer1} and @var{count} are both negative. In that case, @code{ash} puts ones in the empty bit positions on the left, while @code{lsh} puts zeros in those bit positions.
fr_fr: @code{ash} donne les mêmes résultats que @code{lsh} excepté quand @var{integer1} et @var{count} sont tous les deux négatifs. Dans ce cas, @code{ash} met des 1 dans les positions de bit vide du côté gauche, alors que @code{lsh} met des 0 dans ces positions de bit.

source: @code{composition} property, and point display
fr_fr: Propriété @code{composition} et affichage du point

source: @code{concat} can convert a vector or a list into a string. @xref{Creating Strings}.
fr_fr: @code{concat} peut convertir un vecteur ou une liste en une chaîne. @xref{Creating Strings}.

source: @code{define-abbrev} is the low-level basic function for defining an abbrev in a specified abbrev table. When major modes predefine standard abbrevs, they should call @code{define-abbrev} and specify @code{t} for @var{system-flag}. Be aware that any saved non-``system'' abbrevs are restored at startup, i.e. before some major modes are loaded. Major modes should therefore not assume that when they are first loaded their abbrev tables are empty.
fr_fr: @code{define-abbrev} est la fonction de base de bas niveau pour définir les abréviations dans une table d'abréviations indiquée. Si les modes majeurs prédéfinissent la norme des abréviations, ils devraient appeler @code{define-abbrev} et indiquer @code{t} pour @var{system-flag}. Faites attention, les abréviations non sauvés du non-« système » sont restaurées au démarrage, c.-à-d. avant que les modes majeurs sont chargés. C'est pourquoi les modes majeurs ne devraient pas assumer que, quand ils sont d'abord chargés, leurs tables d'abréviations soient vides.

source: @code{display} property, and point display
fr_fr: Propriété @code{display} et affichage du point

source: @code{floatp} does not exist in Emacs versions 18 and earlier.
fr_fr: @code{floatp} n'existe pas dans les versions 18 et précédentes d'Emacs.

source: @code{format}: Emacs's analogue of @code{printf}.
fr_fr: @code{format}: equivalent Emacs du @code{printf}.

source: @code{int-to-string} is a semi-obsolete alias for this function.
fr_fr: @code{int-to-string} est un alias semi-obsolète de cette fonction.

source: @code{lsh}, which is an abbreviation for @dfn{logical shift}, shifts the bits in @var{integer1} to the left @var{count} places, or to the right if @var{count} is negative, bringing zeros into the vacated bits. If @var{count} is negative, @code{lsh} shifts zeros into the leftmost (most-significant) bit, producing a positive result even if @var{integer1} is negative. Contrast this with @code{ash}, below.
fr_fr: @code{lsh}, qui est une abréviation de @dfn{logical shift}, décale les bits dans @var{integer1} de @var{count} places à gauche, ou vers la droite si @var{count} est négatif, introduisant des zéros dans les places vacantes des bits. Si @var{count} est négatif, @code{lsh} décale les zéros dans l'extrême gauche du bit (plus fort), produisant un résultat positif même si @var{integer1} est négatif. Contrairement à @code{ash}, ci-dessous.

source: @code{nil} and @code{t}
fr_fr: @code{nil} et @code{t}

source: @code{no-self-insert} property
fr_fr: Propriété @code{no-self-insert}

source: @code{string-equal} is another name for @code{string=}.
fr_fr: @code{string-equal} est un autre nom pour @code{string=}.

source: @code{string-lessp} is another name for @code{string<}.
fr_fr: @code{string-lessp} est un autre nom pour @code{string<}.

source: @code{string-to-int} is an obsolete alias for this function.
fr_fr: @code{string-to-int} est un alias obsolète de cette fonction.

source: @code{substring} also accepts a vector for the first argument. For example:
fr_fr: @code{substring} accepte aussi un vecteur comme premier argument. Par exemple :

source: @code{vconcat} can convert a string into a vector. @xref{Vector Functions}.
fr_fr: @code{vconcat} peut convertir une chaîne en un vecteur. @xref{Vector Functions}.

source: @code{while} loops.
fr_fr: boucles @code{while}.

source: @dfn{Formatting} means constructing a string by substitution of computed values at various places in a constant string. This constant string controls how the other values are printed, as well as where they appear; it is called a @dfn{format string}.
fr_fr: @dfn{Formatting} signifie construire une chaîne par la substitution, à différents endroits dans une chaîne constante, de valeurs calculées. Cette chaîne constante règle la façon dont les autres valeurs sont affichées, ainsi que là où elles apparaissent; elle s'appelle une @dfn{format string}.

source: @minus{}1 is represented as 29 ones. (This is called @dfn{two's complement} notation.)
fr_fr: @minus{}1 est représenté en tant que 29 unités. (Ceci s'appelle la notation @dfn{two's complement}.)

source: @samp{%} in format
fr_fr: @samp{%} en format

source: @samp{+} as a flag inserts a plus sign before a positive number, so that it always has a sign. A space character as flag inserts a space before a positive number. (Otherwise, positive numbers start with the first digit.) Either of these two flags ensures that positive numbers and negative numbers use the same number of columns. These flags are ignored except for @samp{%d}, @samp{%e}, @samp{%f}, @samp{%g}, and if both flags are used, the @samp{+} takes precedence.
fr_fr: @samp{+} comme indicateur insère un signe plus devant un nombre positif, de sorte qu'il a toujours un signe. Un caractère espace comme indicateur insère un espace devant un nombre positif. (Sinon, les nombres positifs commencent avec le premier chiffre.) L'un ou l'autre de ces indicateurs fait en sorte que les nombres positifs et les nombres négatifs utilisent le même nombre de colonnes. Ces indicateurs sont ignorés sauf pour @samp{%d}, @samp{%e}, @samp{%f}, @samp{%g}, et si les deux indicateurs sont utilisés, le @samp{+} a la priorité.

source: @samp{0.0e+NaN} or @samp{-0.0e+NaN}.
fr_fr: @samp{0.0e+NaN} ou @samp{-0.0e+NaN}.

source: @xref{Definition of safe-length}, for the related function @code{safe-length}.
fr_fr: @xref{Definition of safe-length}, pour la fonction apparentée @code{safe-length}.

source: @xref{Documentation}, for functions that produce textual descriptions of text characters and general input events (@code{single-key-description} and @code{text-char-description}). These are used primarily for making help messages.
fr_fr: @xref{Documentation}, pour ce qui concerne les fonctions qui génèrent les descriptions textuelles des caractères textuels et des évènements généraux d'entrée (@code{single-key-description} et @code{text-char-description}). Ils sont principalement utilisés pour la fabrication de messages d'aide.

source: @xref{Lambda Expressions}, for a more complete description of optional and rest arguments.
fr_fr: @xref{Lambda Expressions}, pour une description plus complète des arguments optionnels et restants.
